emanuellucas2/OVPsimProject/ImperasLib/source/renesas.ovpworld.org/processor/rl78/1.0/model/rl78Decode.c
/*
 * Copyright (c)      2016 eSOL TRINITY, www.esol-trinity.co.jp
 * Copyright (c) 2005-2021 Imperas Software Ltd., www.imperas.com
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,
 * either express or implied.
 *
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

// VMI header files
#include "vmi/vmiCxt.h"
#include "vmi/vmiDecode.h"
#include "vmi/vmiTypes.h"
#include "vmi/vmiRt.h"            // vmirtExit
#include <string.h>                // memset

// model header files
#include "rl78Decode.h"
#include "rl78Structure.h"
#include "rl78Message.h"        // MY_ASSERT




//
// This macro adds a decode table entry for a specific instruction class
//
#define DECODE_ENTRY(_PRIORITY, _NAME, _FMT) \
    vmidNewEntryFmtBin(        \
        table,                \
        #_NAME,                \
        RL78_IT_##_NAME,    \
        _FMT,                \
        _PRIORITY            \
    )

//
// Create the RL78 decode table
//
static vmidDecodeTableP createDecodeTable_1stmap(void) {

    // Allocate a new decode table object to decode instructions 'bits' wide ('bits'
    // is currently restricted to 8, 16 or 32 only)
    // vmidDecodeTableP vmidNewDecodeTable(Uns32 bits, Uns32 defaultValue);
    vmidDecodeTableP table = vmidNewDecodeTable(32, RL78_IT_LAST);

    // The instruction format string, format, contains three kinds of characters:
    //   1. constrained characters (either '0' or '1') - the corresponding bit in the instruction
    //      must have the same value;
    //   2. spacer characters (any of '|', '/', comma, space or tab) - these are ignored and can
    //      be freely used to improve readability of the format string;
    //   3. don't care characters (any character not listed above) - these characters can be
    //      either 0 or 1 in the instruction and it will still match.

    DECODE_ENTRY(1, 1_00_NOP      ,  "|00000000 00000000 00000000 0000 0000|");    // 00
    DECODE_ENTRY(1, 1_02_ADDW     ,  "|00000000 00000000 00000000 0000 0010|");    // 02
    DECODE_ENTRY(1, 1_04_ADDW     ,  "|00000000 00000000 00000000 0000 0100|");    // 04
    DECODE_ENTRY(1, 1_06_ADDW     ,  "|00000000 00000000 00000000 0000 0110|");    // 06
    DECODE_ENTRY(0, 1_0X_ADDW     ,  "|00000000 00000000 00000000 0000 0..1|");    // 0.
    DECODE_ENTRY(1, 1_08_XCH      ,  "|00000000 00000000 00000000 0000 1000|");    // 08
    DECODE_ENTRY(1, 1_09_MOV      ,  "|00000000 00000000 00000000 0000 1001|");    // 09
    DECODE_ENTRY(1, 1_0A_ADD      ,  "|00000000 00000000 00000000 0000 1010|");    // 0A
    DECODE_ENTRY(1, 1_0B_ADD      ,  "|00000000 00000000 00000000 0000 1011|");    // 0B
    DECODE_ENTRY(1, 1_0C_ADD      ,  "|00000000 00000000 00000000 0000 1100|");    // 0C
    DECODE_ENTRY(1, 1_0D_ADD      ,  "|00000000 00000000 00000000 0000 1101|");    // 0D
    DECODE_ENTRY(1, 1_0E_ADD      ,  "|00000000 00000000 00000000 0000 1110|");    // 0E
    DECODE_ENTRY(1, 1_0F_ADD      ,  "|00000000 00000000 00000000 0000 1111|");    // 0F
    DECODE_ENTRY(1, 1_10_ADDW     ,  "|00000000 00000000 00000000 0001 0000|");    // 10
    DECODE_ENTRY(1, 1_11_PREFIX   ,  "|00000000 00000000 00000000 0001 0001|");    // 11
    DECODE_ENTRY(0, 1_1X_MOVW     ,  "|00000000 00000000 00000000 0001 0..0|");    // 1.
    DECODE_ENTRY(0, 1_1Y_MOVW     ,  "|00000000 00000000 00000000 0001 0..1|");    // 1.
    DECODE_ENTRY(1, 1_18_MOV      ,  "|00000000 00000000 00000000 0001 1000|");    // 18
    DECODE_ENTRY(1, 1_19_MOV      ,  "|00000000 00000000 00000000 0001 1001|");    // 19
    DECODE_ENTRY(1, 1_1A_ADDC     ,  "|00000000 00000000 00000000 0001 1010|");    // 1A
    DECODE_ENTRY(1, 1_1B_ADDC     ,  "|00000000 00000000 00000000 0001 1011|");    // 1B
    DECODE_ENTRY(1, 1_1C_ADDC     ,  "|00000000 00000000 00000000 0001 1100|");    // 1C
    DECODE_ENTRY(1, 1_1D_ADDC     ,  "|00000000 00000000 00000000 0001 1101|");    // 1D
    DECODE_ENTRY(1, 1_1E_ADDC     ,  "|00000000 00000000 00000000 0001 1110|");    // 1E
    DECODE_ENTRY(1, 1_1F_ADDC     ,  "|00000000 00000000 00000000 0001 1111|");    // 1F
    DECODE_ENTRY(1, 1_20_SUBW     ,  "|00000000 00000000 00000000 0010 0000|");    // 20
    DECODE_ENTRY(1, 1_22_SUBW     ,  "|00000000 00000000 00000000 0010 0010|");    // 22
    DECODE_ENTRY(1, 1_24_SUBW     ,  "|00000000 00000000 00000000 0010 0100|");    // 24
    DECODE_ENTRY(1, 1_26_SUBW     ,  "|00000000 00000000 00000000 0010 0110|");    // 26
    DECODE_ENTRY(0, 1_2X_SUBW     ,  "|00000000 00000000 00000000 0010 0..1|");    // 2.
    DECODE_ENTRY(1, 1_28_MOV      ,  "|00000000 00000000 00000000 0010 1000|");    // 28
    DECODE_ENTRY(1, 1_29_MOV      ,  "|00000000 00000000 00000000 0010 1001|");    // 29
    DECODE_ENTRY(1, 1_2A_SUB      ,  "|00000000 00000000 00000000 0010 1010|");    // 2A
    DECODE_ENTRY(1, 1_2B_SUB      ,  "|00000000 00000000 00000000 0010 1011|");    // 2B
    DECODE_ENTRY(1, 1_2C_SUB      ,  "|00000000 00000000 00000000 0010 1100|");    // 2C
    DECODE_ENTRY(1, 1_2D_SUB      ,  "|00000000 00000000 00000000 0010 1101|");    // 2D
    DECODE_ENTRY(1, 1_2E_SUB      ,  "|00000000 00000000 00000000 0010 1110|");    // 2E
    DECODE_ENTRY(1, 1_2F_SUB      ,  "|00000000 00000000 00000000 0010 1111|");    // 2F
    DECODE_ENTRY(1, 1_31_4thmap   ,  "|00000000 00000000 00000000 0011 0001|");    // 31        // 4th map
    DECODE_ENTRY(0, 1_3X_XCHW     ,  "|00000000 00000000 00000000 0011 0..1|");    // 3.
    DECODE_ENTRY(0, 1_3Y_MOVW     ,  "|00000000 00000000 00000000 0011 0..0|");    // 3.
    DECODE_ENTRY(1, 1_38_MOV      ,  "|00000000 00000000 00000000 0011 1000|");    // 38
    DECODE_ENTRY(1, 1_39_MOV      ,  "|00000000 00000000 00000000 0011 1001|");    // 39
    DECODE_ENTRY(1, 1_3A_SUBC     ,  "|00000000 00000000 00000000 0011 1010|");    // 3A
    DECODE_ENTRY(1, 1_3B_SUBC     ,  "|00000000 00000000 00000000 0011 1011|");    // 3B
    DECODE_ENTRY(1, 1_3C_SUBC     ,  "|00000000 00000000 00000000 0011 1100|");    // 3C
    DECODE_ENTRY(1, 1_3D_SUBC     ,  "|00000000 00000000 00000000 0011 1101|");    // 3D
    DECODE_ENTRY(1, 1_3E_SUBC     ,  "|00000000 00000000 00000000 0011 1110|");    // 3E
    DECODE_ENTRY(1, 1_3F_SUBC     ,  "|00000000 00000000 00000000 0011 1111|");    // 3F
    DECODE_ENTRY(1, 1_40_CMP      ,  "|00000000 00000000 00000000 0100 0000|");    // 40
    DECODE_ENTRY(1, 1_41_MOV      ,  "|00000000 00000000 00000000 0100 0001|");    // 41
    DECODE_ENTRY(1, 1_42_CMPW     ,  "|00000000 00000000 00000000 0100 0010|");    // 42
    DECODE_ENTRY(1, 1_44_CMPW     ,  "|00000000 00000000 00000000 0100 0100|");    // 44
    DECODE_ENTRY(1, 1_46_CMPW     ,  "|00000000 00000000 00000000 0100 0110|");    // 46
    DECODE_ENTRY(0, 1_4X_CMPW     ,  "|00000000 00000000 00000000 0100 0..1|");    // 4.
    DECODE_ENTRY(1, 1_48_MOV      ,  "|00000000 00000000 00000000 0100 1000|");    // 48
    DECODE_ENTRY(1, 1_49_MOV      ,  "|00000000 00000000 00000000 0100 1001|");    // 49
    DECODE_ENTRY(1, 1_4A_CMP      ,  "|00000000 00000000 00000000 0100 1010|");    // 4A
    DECODE_ENTRY(1, 1_4B_CMP      ,  "|00000000 00000000 00000000 0100 1011|");    // 4B
    DECODE_ENTRY(1, 1_4C_CMP      ,  "|00000000 00000000 00000000 0100 1100|");    // 4C
    DECODE_ENTRY(1, 1_4D_CMP      ,  "|00000000 00000000 00000000 0100 1101|");    // 4D
    DECODE_ENTRY(1, 1_4E_CMP      ,  "|00000000 00000000 00000000 0100 1110|");    // 4E
    DECODE_ENTRY(1, 1_4F_CMP      ,  "|00000000 00000000 00000000 0100 1111|");    // 4F
    DECODE_ENTRY(0, 1_5X_MOV      ,  "|00000000 00000000 00000000 0101 0...|");    // 5.
    DECODE_ENTRY(1, 1_58_MOVW     ,  "|00000000 00000000 00000000 0101 1000|");    // 58
    DECODE_ENTRY(1, 1_59_MOVW     ,  "|00000000 00000000 00000000 0101 1001|");    // 59
    DECODE_ENTRY(1, 1_5A_AND      ,  "|00000000 00000000 00000000 0101 1010|");    // 5A
    DECODE_ENTRY(1, 1_5B_AND      ,  "|00000000 00000000 00000000 0101 1011|");    // 5B
    DECODE_ENTRY(1, 1_5C_AND      ,  "|00000000 00000000 00000000 0101 1100|");    // 5C
    DECODE_ENTRY(1, 1_5D_AND      ,  "|00000000 00000000 00000000 0101 1101|");    // 5D
    DECODE_ENTRY(1, 1_5E_AND      ,  "|00000000 00000000 00000000 0101 1110|");    // 5E
    DECODE_ENTRY(1, 1_5F_AND      ,  "|00000000 00000000 00000000 0101 1111|");    // 5F
    DECODE_ENTRY(1, 1_61_2ndmap   ,  "|00000000 00000000 00000000 0110 0001|");    // 61        // 2nd map
    DECODE_ENTRY(0, 1_6X_MOV      ,  "|00000000 00000000 00000000 0110 0...|");    // 6.
    DECODE_ENTRY(1, 1_68_MOVW     ,  "|00000000 00000000 00000000 0110 1000|");    // 68
    DECODE_ENTRY(1, 1_69_MOVW     ,  "|00000000 00000000 00000000 0110 1001|");    // 69
    DECODE_ENTRY(1, 1_6A_OR       ,  "|00000000 00000000 00000000 0110 1010|");    // 6A
    DECODE_ENTRY(1, 1_6B_OR       ,  "|00000000 00000000 00000000 0110 1011|");    // 6B
    DECODE_ENTRY(1, 1_6C_OR       ,  "|00000000 00000000 00000000 0110 1100|");    // 6C
    DECODE_ENTRY(1, 1_6D_OR       ,  "|00000000 00000000 00000000 0110 1101|");    // 6D
    DECODE_ENTRY(1, 1_6E_OR       ,  "|00000000 00000000 00000000 0110 1110|");    // 6E
    DECODE_ENTRY(1, 1_6F_OR       ,  "|00000000 00000000 00000000 0110 1111|");    // 6F
    DECODE_ENTRY(1, 1_71_3rdmap   ,  "|00000000 00000000 00000000 0111 0001|");    // 71        // 3rd map
    DECODE_ENTRY(0, 1_7X_MOV      ,  "|00000000 00000000 00000000 0111 0...|");    // 7.
    DECODE_ENTRY(1, 1_78_MOVW     ,  "|00000000 00000000 00000000 0111 1000|");    // 78
    DECODE_ENTRY(1, 1_79_MOVW     ,  "|00000000 00000000 00000000 0111 1001|");    // 79
    DECODE_ENTRY(1, 1_7A_XOR      ,  "|00000000 00000000 00000000 0111 1010|");    // 7A
    DECODE_ENTRY(1, 1_7B_XOR      ,  "|00000000 00000000 00000000 0111 1011|");    // 7B
    DECODE_ENTRY(1, 1_7C_XOR      ,  "|00000000 00000000 00000000 0111 1100|");    // 7C
    DECODE_ENTRY(1, 1_7D_XOR      ,  "|00000000 00000000 00000000 0111 1101|");    // 7D
    DECODE_ENTRY(1, 1_7E_XOR      ,  "|00000000 00000000 00000000 0111 1110|");    // 7E
    DECODE_ENTRY(1, 1_7F_XOR      ,  "|00000000 00000000 00000000 0111 1111|");    // 7F
    DECODE_ENTRY(0, 1_8X_INC      ,  "|00000000 00000000 00000000 1000 0...|");    // 8.
    DECODE_ENTRY(1, 1_88_MOV      ,  "|00000000 00000000 00000000 1000 1000|");    // 88
    DECODE_ENTRY(1, 1_89_MOV      ,  "|00000000 00000000 00000000 1000 1001|");    // 89
    DECODE_ENTRY(1, 1_8A_MOV      ,  "|00000000 00000000 00000000 1000 1010|");    // 8A
    DECODE_ENTRY(1, 1_8B_MOV      ,  "|00000000 00000000 00000000 1000 1011|");    // 8B
    DECODE_ENTRY(1, 1_8C_MOV      ,  "|00000000 00000000 00000000 1000 1100|");    // 8C
    DECODE_ENTRY(1, 1_8D_MOV      ,  "|00000000 00000000 00000000 1000 1101|");    // 8D
    DECODE_ENTRY(1, 1_8E_MOV      ,  "|00000000 00000000 00000000 1000 1110|");    // 8E
    DECODE_ENTRY(1, 1_8F_MOV      ,  "|00000000 00000000 00000000 1000 1111|");    // 8F
    DECODE_ENTRY(0, 1_9X_DEC      ,  "|00000000 00000000 00000000 1001 0...|");    // 9.
    DECODE_ENTRY(1, 1_98_MOV      ,  "|00000000 00000000 00000000 1001 1000|");    // 98
    DECODE_ENTRY(1, 1_99_MOV      ,  "|00000000 00000000 00000000 1001 1001|");    // 99
    DECODE_ENTRY(1, 1_9A_MOV      ,  "|00000000 00000000 00000000 1001 1010|");    // 9A
    DECODE_ENTRY(1, 1_9B_MOV      ,  "|00000000 00000000 00000000 1001 1011|");    // 9B
    DECODE_ENTRY(1, 1_9C_MOV      ,  "|00000000 00000000 00000000 1001 1100|");    // 9C
    DECODE_ENTRY(1, 1_9D_MOV      ,  "|00000000 00000000 00000000 1001 1101|");    // 9D
    DECODE_ENTRY(1, 1_9E_MOV      ,  "|00000000 00000000 00000000 1001 1110|");    // 9E
    DECODE_ENTRY(1, 1_9F_MOV      ,  "|00000000 00000000 00000000 1001 1111|");    // 9F
    DECODE_ENTRY(1, 1_A0_INC      ,  "|00000000 00000000 00000000 1010 0000|");    // A0
    DECODE_ENTRY(1, 1_A2_INCW     ,  "|00000000 00000000 00000000 1010 0010|");    // A2
    DECODE_ENTRY(1, 1_A4_INC      ,  "|00000000 00000000 00000000 1010 0100|");    // A4
    DECODE_ENTRY(1, 1_A6_INCW     ,  "|00000000 00000000 00000000 1010 0110|");    // A6
    DECODE_ENTRY(0, 1_AX_INCW     ,  "|00000000 00000000 00000000 1010 0..1|");    // A.
    DECODE_ENTRY(1, 1_A8_MOVW     ,  "|00000000 00000000 00000000 1010 1000|");    // A8
    DECODE_ENTRY(1, 1_A9_MOVW     ,  "|00000000 00000000 00000000 1010 1001|");    // A9
    DECODE_ENTRY(1, 1_AA_MOVW     ,  "|00000000 00000000 00000000 1010 1010|");    // AA
    DECODE_ENTRY(1, 1_AB_MOVW     ,  "|00000000 00000000 00000000 1010 1011|");    // AB
    DECODE_ENTRY(1, 1_AC_MOVW     ,  "|00000000 00000000 00000000 1010 1100|");    // AC
    DECODE_ENTRY(1, 1_AD_MOVW     ,  "|00000000 00000000 00000000 1010 1101|");    // AD
    DECODE_ENTRY(1, 1_AE_MOVW     ,  "|00000000 00000000 00000000 1010 1110|");    // AE
    DECODE_ENTRY(1, 1_AF_MOVW     ,  "|00000000 00000000 00000000 1010 1111|");    // AF
    DECODE_ENTRY(1, 1_B0_DEC      ,  "|00000000 00000000 00000000 1011 0000|");    // B0
    DECODE_ENTRY(1, 1_B2_DECW     ,  "|00000000 00000000 00000000 1011 0010|");    // B2
    DECODE_ENTRY(1, 1_B4_DEC      ,  "|00000000 00000000 00000000 1011 0100|");    // B4
    DECODE_ENTRY(1, 1_B6_DECW     ,  "|00000000 00000000 00000000 1011 0110|");    // B6
    DECODE_ENTRY(0, 1_BX_DECW     ,  "|00000000 00000000 00000000 1011 0..1|");    // B.
    DECODE_ENTRY(1, 1_B8_MOVW     ,  "|00000000 00000000 00000000 1011 1000|");    // B8
    DECODE_ENTRY(1, 1_B9_MOVW     ,  "|00000000 00000000 00000000 1011 1001|");    // B9
    DECODE_ENTRY(1, 1_BA_MOVW     ,  "|00000000 00000000 00000000 1011 1010|");    // BA
    DECODE_ENTRY(1, 1_BB_MOVW     ,  "|00000000 00000000 00000000 1011 1011|");    // BB
    DECODE_ENTRY(1, 1_BC_MOVW     ,  "|00000000 00000000 00000000 1011 1100|");    // BC
    DECODE_ENTRY(1, 1_BD_MOVW     ,  "|00000000 00000000 00000000 1011 1101|");    // BD
    DECODE_ENTRY(1, 1_BE_MOVW     ,  "|00000000 00000000 00000000 1011 1110|");    // BE
    DECODE_ENTRY(1, 1_BF_MOVW     ,  "|00000000 00000000 00000000 1011 1111|");    // BF
    DECODE_ENTRY(0, 1_CX_POP      ,  "|00000000 00000000 00000000 1100 0..0|");    // C.
    DECODE_ENTRY(0, 1_CY_PUSH     ,  "|00000000 00000000 00000000 1100 0..1|");    // C.
    DECODE_ENTRY(1, 1_C8_MOV      ,  "|00000000 00000000 00000000 1100 1000|");    // C8
    DECODE_ENTRY(1, 1_C9_MOVW     ,  "|00000000 00000000 00000000 1100 1001|");    // C9
    DECODE_ENTRY(1, 1_CA_MOV      ,  "|00000000 00000000 00000000 1100 1010|");    // CA
    DECODE_ENTRY(1, 1_CB_MOVW     ,  "|00000000 00000000 00000000 1100 1011|");    // CB
    DECODE_ENTRY(1, 1_CC_MOV      ,  "|00000000 00000000 00000000 1100 1100|");    // CC
    DECODE_ENTRY(1, 1_CD_MOV      ,  "|00000000 00000000 00000000 1100 1101|");    // CD
    DECODE_ENTRY(1, 1_CE_MOV_SFR  ,  "|00000000 00000000 00000000 1100 1110|");    // CE
    //                1_CE_MOV_PSW
    //                1_CE_MOV_CS
    DECODE_ENTRY(1, 1_CF_MOV      ,  "|00000000 00000000 00000000 1100 1111|");    // CF
    DECODE_ENTRY(0, 1_DX_CMP0     ,  "|00000000 00000000 00000000 1101 00..|");    // D.
    DECODE_ENTRY(1, 1_D4_CMP0     ,  "|00000000 00000000 00000000 1101 0100|");    // D4
    DECODE_ENTRY(1, 1_D5_CMP0     ,  "|00000000 00000000 00000000 1101 0101|");    // D5
    DECODE_ENTRY(1, 1_D6_MULU     ,  "|00000000 00000000 00000000 1101 0110|");    // D6
    DECODE_ENTRY(1, 1_D7_RET      ,  "|00000000 00000000 00000000 1101 0111|");    // D7
    DECODE_ENTRY(1, 1_D8_MOV      ,  "|00000000 00000000 00000000 1101 1000|");    // D8
    DECODE_ENTRY(1, 1_D9_MOV      ,  "|00000000 00000000 00000000 1101 1001|");    // D9
    DECODE_ENTRY(1, 1_DC_BC       ,  "|00000000 00000000 00000000 1101 1100|");    // DC
    DECODE_ENTRY(1, 1_DD_BZ       ,  "|00000000 00000000 00000000 1101 1101|");    // DD
    DECODE_ENTRY(1, 1_DE_BNC      ,  "|00000000 00000000 00000000 1101 1110|");    // DE
    DECODE_ENTRY(1, 1_DF_BNZ      ,  "|00000000 00000000 00000000 1101 1111|");    // DF
    DECODE_ENTRY(0, 1_EX_ONEB     ,  "|00000000 00000000 00000000 1110 00..|");    // E.
    DECODE_ENTRY(1, 1_E4_ONEB     ,  "|00000000 00000000 00000000 1110 0100|");    // E4
    DECODE_ENTRY(1, 1_E5_ONEB     ,  "|00000000 00000000 00000000 1110 0101|");    // E5
    DECODE_ENTRY(1, 1_E6_ONEW     ,  "|00000000 00000000 00000000 1110 0110|");    // E6
    DECODE_ENTRY(1, 1_E7_ONEW     ,  "|00000000 00000000 00000000 1110 0111|");    // E7
    DECODE_ENTRY(1, 1_E8_MOV      ,  "|00000000 00000000 00000000 1110 1000|");    // E8
    DECODE_ENTRY(1, 1_E9_MOV      ,  "|00000000 00000000 00000000 1110 1001|");    // E9
    DECODE_ENTRY(1, 1_EC_BR       ,  "|00000000 00000000 00000000 1110 1100|");    // EC
    DECODE_ENTRY(1, 1_ED_BR       ,  "|00000000 00000000 00000000 1110 1101|");    // ED
    DECODE_ENTRY(1, 1_EE_BR       ,  "|00000000 00000000 00000000 1110 1110|");    // EE
    DECODE_ENTRY(1, 1_EF_BR       ,  "|00000000 00000000 00000000 1110 1111|");    // EF
    DECODE_ENTRY(0, 1_FX_CLRB     ,  "|00000000 00000000 00000000 1111 00..|");    // F.
    DECODE_ENTRY(1, 1_F4_CLRB     ,  "|00000000 00000000 00000000 1111 0100|");    // F4
    DECODE_ENTRY(1, 1_F5_CLRB     ,  "|00000000 00000000 00000000 1111 0101|");    // F5
    DECODE_ENTRY(1, 1_F6_CLRW     ,  "|00000000 00000000 00000000 1111 0110|");    // F6
    DECODE_ENTRY(1, 1_F7_CLRW     ,  "|00000000 00000000 00000000 1111 0111|");    // F7
    DECODE_ENTRY(1, 1_F8_MOV      ,  "|00000000 00000000 00000000 1111 1000|");    // F8
    DECODE_ENTRY(1, 1_F9_MOV      ,  "|00000000 00000000 00000000 1111 1001|");    // F9
    DECODE_ENTRY(1, 1_FC_CALL     ,  "|00000000 00000000 00000000 1111 1100|");    // FC
    DECODE_ENTRY(1, 1_FD_CALL     ,  "|00000000 00000000 00000000 1111 1101|");    // FD
    DECODE_ENTRY(1, 1_FE_CALL     ,  "|00000000 00000000 00000000 1111 1110|");    // FE
    DECODE_ENTRY(0, 1_XA_MOVW     ,  "|00000000 00000000 00000000 11.. 1010|");    // .A
    DECODE_ENTRY(0, 1_XB_MOVW     ,  "|00000000 00000000 00000000 11.. 1011|");    // .B

    return table;
}

