emanuellucas2/OVPsimProject/ImperasLib/source/renesas.ovpworld.org/processor/rl78/1.0/model/rl78Decode.c
static vmidDecodeTableP createDecodeTable_2ndmap(void) {
    vmidDecodeTableP table = vmidNewDecodeTable(32, RL78_IT_LAST);

    DECODE_ENTRY(0, 2_0X_ADD      ,  "|00000000 00000000 00000000 0000 0...|");    // 61 0.
    DECODE_ENTRY(1, 2_09_ADDW     ,  "|00000000 00000000 00000000 0000 1001|");    // 61 09
    DECODE_ENTRY(0, 2_0Y_ADD      ,  "|00000000 00000000 00000000 0000 1...|");    // 61 0.
    DECODE_ENTRY(0, 2_1X_ADDC     ,  "|00000000 00000000 00000000 0001 0...|");    // 61 1.
    DECODE_ENTRY(0, 2_1Y_ADDC     ,  "|00000000 00000000 00000000 0001 1...|");    // 61 1.
    DECODE_ENTRY(0, 2_2X_SUB      ,  "|00000000 00000000 00000000 0010 0...|");    // 61 2.
    DECODE_ENTRY(1, 2_29_SUBW     ,  "|00000000 00000000 00000000 0010 1001|");    // 61 29
    DECODE_ENTRY(0, 2_2Y_SUB      ,  "|00000000 00000000 00000000 0010 1...|");    // 61 2.
    DECODE_ENTRY(0, 2_3X_SUBC     ,  "|00000000 00000000 00000000 0011 0...|");    // 61 3.
    DECODE_ENTRY(0, 2_3Y_SUBC     ,  "|00000000 00000000 00000000 0011 1...|");    // 61 3.
    DECODE_ENTRY(0, 2_4X_CMP      ,  "|00000000 00000000 00000000 0100 0...|");    // 61 4.
    DECODE_ENTRY(1, 2_49_CMPW     ,  "|00000000 00000000 00000000 0100 1001|");    // 61 49
    DECODE_ENTRY(0, 2_4Y_CMP      ,  "|00000000 00000000 00000000 0100 1...|");    // 61 4.
    DECODE_ENTRY(0, 2_5X_AND      ,  "|00000000 00000000 00000000 0101 0...|");    // 61 5.
    DECODE_ENTRY(1, 2_59_INC      ,  "|00000000 00000000 00000000 0101 1001|");    // 61 59
    DECODE_ENTRY(0, 2_5Y_AND      ,  "|00000000 00000000 00000000 0101 1...|");    // 61 5.
    DECODE_ENTRY(0, 2_6X_OR       ,  "|00000000 00000000 00000000 0110 0...|");    // 61 6.
    DECODE_ENTRY(1, 2_69_DEC      ,  "|00000000 00000000 00000000 0110 1001|");    // 61 69
    DECODE_ENTRY(0, 2_6Y_OR       ,  "|00000000 00000000 00000000 0110 1...|");    // 61 6.
    DECODE_ENTRY(0, 2_7X_XOR      ,  "|00000000 00000000 00000000 0111 0...|");    // 61 7.
    DECODE_ENTRY(1, 2_79_INCW     ,  "|00000000 00000000 00000000 0111 1001|");    // 61 79
    DECODE_ENTRY(0, 2_7Y_XOR      ,  "|00000000 00000000 00000000 0111 1...|");    // 61 7.
    DECODE_ENTRY(1, 2_80_ADD      ,  "|00000000 00000000 00000000 1000 0000|");    // 61 80
    DECODE_ENTRY(1, 2_82_ADD      ,  "|00000000 00000000 00000000 1000 0010|");    // 61 82
    DECODE_ENTRY(1, 2_89_DECW     ,  "|00000000 00000000 00000000 1000 1001|");    // 61 89
    DECODE_ENTRY(0, 2_8X_XCH      ,  "|00000000 00000000 00000000 1000 1...|");    // 61 8.
    DECODE_ENTRY(1, 2_90_ADDC     ,  "|00000000 00000000 00000000 1001 0000|");    // 61 90
    DECODE_ENTRY(1, 2_92_ADDC     ,  "|00000000 00000000 00000000 1001 0010|");    // 61 92
    DECODE_ENTRY(1, 2_A0_SUB      ,  "|00000000 00000000 00000000 1010 0000|");    // 61 A0
    DECODE_ENTRY(1, 2_A2_SUB      ,  "|00000000 00000000 00000000 1010 0010|");    // 61 A2
    DECODE_ENTRY(1, 2_A8_XCH      ,  "|00000000 00000000 00000000 1010 1000|");    // 61 A8
    DECODE_ENTRY(1, 2_A9_XCH      ,  "|00000000 00000000 00000000 1010 1001|");    // 61 A9
    DECODE_ENTRY(1, 2_AA_XCH      ,  "|00000000 00000000 00000000 1010 1010|");    // 61 AA
    DECODE_ENTRY(1, 2_AB_XCH      ,  "|00000000 00000000 00000000 1010 1011|");    // 61 AB
    DECODE_ENTRY(1, 2_AC_XCH      ,  "|00000000 00000000 00000000 1010 1100|");    // 61 AC
    DECODE_ENTRY(1, 2_AD_XCH      ,  "|00000000 00000000 00000000 1010 1101|");    // 61 AD
    DECODE_ENTRY(1, 2_AE_XCH      ,  "|00000000 00000000 00000000 1010 1110|");    // 61 AE
    DECODE_ENTRY(1, 2_AF_XCH      ,  "|00000000 00000000 00000000 1010 1111|");    // 61 AF
    DECODE_ENTRY(1, 2_B0_SUBC     ,  "|00000000 00000000 00000000 1011 0000|");    // 61 B0
    DECODE_ENTRY(1, 2_B2_SUBC     ,  "|00000000 00000000 00000000 1011 0010|");    // 61 B2
    DECODE_ENTRY(1, 2_B8_MOV      ,  "|00000000 00000000 00000000 1011 1000|");    // 61 B8
    DECODE_ENTRY(1, 2_B9_XCH      ,  "|00000000 00000000 00000000 1011 1001|");    // 61 B9
    DECODE_ENTRY(1, 2_C0_CMP      ,  "|00000000 00000000 00000000 1100 0000|");    // 61 C0
    DECODE_ENTRY(1, 2_C2_CMP      ,  "|00000000 00000000 00000000 1100 0010|");    // 61 C2
    DECODE_ENTRY(1, 2_C3_BH       ,  "|00000000 00000000 00000000 1100 0011|");    // 61 C3
    DECODE_ENTRY(1, 2_C8_SKC      ,  "|00000000 00000000 00000000 1100 1000|");    // 61 C8
    DECODE_ENTRY(1, 2_C9_MOV      ,  "|00000000 00000000 00000000 1100 1001|");    // 61 C9
    DECODE_ENTRY(1, 2_CB_BR       ,  "|00000000 00000000 00000000 1100 1011|");    // 61 CB
    DECODE_ENTRY(1, 2_CC_BRK      ,  "|00000000 00000000 00000000 1100 1100|");    // 61 CC
    DECODE_ENTRY(1, 2_CD_POP      ,  "|00000000 00000000 00000000 1100 1101|");    // 61 CD
    DECODE_ENTRY(1, 2_CE_MOVS     ,  "|00000000 00000000 00000000 1100 1110|");    // 61 CE
    DECODE_ENTRY(1, 2_D0_AND      ,  "|00000000 00000000 00000000 1101 0000|");    // 61 D0
    DECODE_ENTRY(1, 2_D2_AND      ,  "|00000000 00000000 00000000 1101 0010|");    // 61 D2
    DECODE_ENTRY(1, 2_D3_BNH      ,  "|00000000 00000000 00000000 1101 0011|");    // 61 D3
    DECODE_ENTRY(1, 2_D8_SKNC     ,  "|00000000 00000000 00000000 1101 1000|");    // 61 D8
    DECODE_ENTRY(1, 2_D9_MOV      ,  "|00000000 00000000 00000000 1101 1001|");    // 61 D9
    DECODE_ENTRY(1, 2_DB_ROR      ,  "|00000000 00000000 00000000 1101 1011|");    // 61 DB
    DECODE_ENTRY(1, 2_DC_ROLC     ,  "|00000000 00000000 00000000 1101 1100|");    // 61 DC
    DECODE_ENTRY(1, 2_DD_PUSH     ,  "|00000000 00000000 00000000 1101 1101|");    // 61 DD
    DECODE_ENTRY(1, 2_DE_CMPS     ,  "|00000000 00000000 00000000 1101 1110|");    // 61 DE
    DECODE_ENTRY(1, 2_E0_OR       ,  "|00000000 00000000 00000000 1110 0000|");    // 61 E0
    DECODE_ENTRY(1, 2_E2_OR       ,  "|00000000 00000000 00000000 1110 0010|");    // 61 E2
    DECODE_ENTRY(1, 2_E3_SKH      ,  "|00000000 00000000 00000000 1110 0011|");    // 61 E3
    DECODE_ENTRY(1, 2_E8_SKZ      ,  "|00000000 00000000 00000000 1110 1000|");    // 61 E8
    DECODE_ENTRY(1, 2_E9_MOV      ,  "|00000000 00000000 00000000 1110 1001|");    // 61 E9
    DECODE_ENTRY(1, 2_EB_ROL      ,  "|00000000 00000000 00000000 1110 1011|");    // 61 EB
    DECODE_ENTRY(1, 2_EC_RETB     ,  "|00000000 00000000 00000000 1110 1100|");    // 61 EC
    DECODE_ENTRY(1, 2_ED_HALT     ,  "|00000000 00000000 00000000 1110 1101|");    // 61 ED
    DECODE_ENTRY(1, 2_F0_XOR      ,  "|00000000 00000000 00000000 1111 0000|");    // 61 F0
    DECODE_ENTRY(1, 2_F2_XOR      ,  "|00000000 00000000 00000000 1111 0010|");    // 61 F2
    DECODE_ENTRY(1, 2_F3_SKNH     ,  "|00000000 00000000 00000000 1111 0011|");    // 61 F3
    DECODE_ENTRY(1, 2_F8_SKNZ     ,  "|00000000 00000000 00000000 1111 1000|");    // 61 F8
    DECODE_ENTRY(1, 2_F9_MOV      ,  "|00000000 00000000 00000000 1111 1001|");    // 61 F9
    DECODE_ENTRY(1, 2_FB_RORC     ,  "|00000000 00000000 00000000 1111 1011|");    // 61 FB
    DECODE_ENTRY(1, 2_FC_RETI     ,  "|00000000 00000000 00000000 1111 1100|");    // 61 FC
    DECODE_ENTRY(1, 2_FD_STOP     ,  "|00000000 00000000 00000000 1111 1101|");    // 61 FD
    DECODE_ENTRY(0, 2_XE_ROLWC    ,  "|00000000 00000000 00000000 111. 1110|");    // 61 .E
    DECODE_ENTRY(0, 2_XF_SEL      ,  "|00000000 00000000 00000000 11.. 1111|");    // 61 .F
    DECODE_ENTRY(0, 2_XA_CALL     ,  "|00000000 00000000 00000000 11.. 1010|");    // 61 .A
    DECODE_ENTRY(0, 2_XX_CALLT    ,  "|00000000 00000000 00000000 1... 01..|");    // 61 ..

    return table;
}

static vmidDecodeTableP createDecodeTable_3rdmap(void) {
    vmidDecodeTableP table = vmidNewDecodeTable(32, RL78_IT_LAST);

