emanuellucas2/OVPsimProject/ImperasLib/source/renesas.ovpworld.org/processor/rl78/1.0/model/rl78Decode.c
    DECODE_ENTRY(0, 3_X0_SET1     ,  "|00000000 00000000 00000000 0... 0000|");    // 71 .0
    DECODE_ENTRY(0, 3_X1_MOV1     ,  "|00000000 00000000 00000000 0... 0001|");    // 71 .1
    DECODE_ENTRY(0, 3_X2_SET1     ,  "|00000000 00000000 00000000 0... 0010|");    // 71 .2
    DECODE_ENTRY(0, 3_X3_CLR1     ,  "|00000000 00000000 00000000 0... 0011|");    // 71 .3
    DECODE_ENTRY(0, 3_X4_MOV1     ,  "|00000000 00000000 00000000 0... 0100|");    // 71 .4
    DECODE_ENTRY(0, 3_X5_AND1     ,  "|00000000 00000000 00000000 0... 0101|");    // 71 .5
    DECODE_ENTRY(0, 3_X6_OR1      ,  "|00000000 00000000 00000000 0... 0110|");    // 71 .6
    DECODE_ENTRY(0, 3_X7_XOR1     ,  "|00000000 00000000 00000000 0... 0111|");    // 71 .7
    DECODE_ENTRY(0, 3_X8_CLR1     ,  "|00000000 00000000 00000000 0... 1000|");    // 71 .8
    DECODE_ENTRY(0, 3_X9_MOV1     ,  "|00000000 00000000 00000000 0... 1001|");    // 71 .9
    DECODE_ENTRY(0, 3_XA_SET1     ,  "|00000000 00000000 00000000 0... 1010|");    // 71 .A
    DECODE_ENTRY(0, 3_XB_CLR1     ,  "|00000000 00000000 00000000 0... 1011|");    // 71 .B
    DECODE_ENTRY(0, 3_XC_MOV1     ,  "|00000000 00000000 00000000 0... 1100|");    // 71 .C
    DECODE_ENTRY(0, 3_XD_AND1     ,  "|00000000 00000000 00000000 0... 1101|");    // 71 .D
    DECODE_ENTRY(0, 3_XE_OR1      ,  "|00000000 00000000 00000000 0... 1110|");    // 71 .E
    DECODE_ENTRY(0, 3_XF_XOR1     ,  "|00000000 00000000 00000000 0... 1111|");    // 71 .F
    DECODE_ENTRY(1, 3_80_SET1     ,  "|00000000 00000000 00000000 1000 0000|");    // 71 80
    DECODE_ENTRY(1, 3_88_CLR1     ,  "|00000000 00000000 00000000 1000 1000|");    // 71 88
    DECODE_ENTRY(1, 3_C0_NOT1     ,  "|00000000 00000000 00000000 1100 0000|");    // 71 C0
    DECODE_ENTRY(0, 3_Y1_MOV1     ,  "|00000000 00000000 00000000 1... 0001|");    // 71 .1
    DECODE_ENTRY(0, 3_Y2_SET1     ,  "|00000000 00000000 00000000 1... 0010|");    // 71 .2
    DECODE_ENTRY(0, 3_Y3_CLR1     ,  "|00000000 00000000 00000000 1... 0011|");    // 71 .3
    DECODE_ENTRY(0, 3_Y4_MOV1     ,  "|00000000 00000000 00000000 1... 0100|");    // 71 .4
    DECODE_ENTRY(0, 3_Y5_AND1     ,  "|00000000 00000000 00000000 1... 0101|");    // 71 .5
    DECODE_ENTRY(0, 3_Y6_OR1      ,  "|00000000 00000000 00000000 1... 0110|");    // 71 .6
    DECODE_ENTRY(0, 3_Y7_XOR1     ,  "|00000000 00000000 00000000 1... 0111|");    // 71 .7
    DECODE_ENTRY(0, 3_Y9_MOV1     ,  "|00000000 00000000 00000000 1... 1001|");    // 71 .9
    DECODE_ENTRY(0, 3_YA_SET1     ,  "|00000000 00000000 00000000 1... 1010|");    // 71 .A
    DECODE_ENTRY(0, 3_YB_CLR1     ,  "|00000000 00000000 00000000 1... 1011|");    // 71 .B
    DECODE_ENTRY(0, 3_YC_MOV1     ,  "|00000000 00000000 00000000 1... 1100|");    // 71 .C
    DECODE_ENTRY(0, 3_YD_AND1     ,  "|00000000 00000000 00000000 1... 1101|");    // 71 .D
    DECODE_ENTRY(0, 3_YE_OR1      ,  "|00000000 00000000 00000000 1... 1110|");    // 71 .E
    DECODE_ENTRY(0, 3_YF_XOR1     ,  "|00000000 00000000 00000000 1... 1111|");    // 71 .F

    return table;
}

static vmidDecodeTableP createDecodeTable_4thmap(void) {
    vmidDecodeTableP table = vmidNewDecodeTable(32, RL78_IT_LAST);

    DECODE_ENTRY(0, 4_X0_BTCLR    ,  "|00000000 00000000 00000000 0... 0000|");    // 31 .0
    DECODE_ENTRY(0, 4_X1_BTCLR    ,  "|00000000 00000000 00000000 0... 0001|");    // 31 .1
    DECODE_ENTRY(0, 4_X2_BT       ,  "|00000000 00000000 00000000 0... 0010|");    // 31 .2
    DECODE_ENTRY(0, 4_X3_BT       ,  "|00000000 00000000 00000000 0... 0011|");    // 31 .3
    DECODE_ENTRY(0, 4_X4_BF       ,  "|00000000 00000000 00000000 0... 0100|");    // 31 .4
    DECODE_ENTRY(0, 4_X5_BF       ,  "|00000000 00000000 00000000 0... 0101|");    // 31 .5
    DECODE_ENTRY(0, 4_X7_SHL      ,  "|00000000 00000000 00000000 0... 0111|");    // 31 .7
    DECODE_ENTRY(0, 4_X8_SHL      ,  "|00000000 00000000 00000000 0... 1000|");    // 31 .8
    DECODE_ENTRY(0, 4_X9_SHL      ,  "|00000000 00000000 00000000 0... 1001|");    // 31 .9
    DECODE_ENTRY(0, 4_XA_SHR      ,  "|00000000 00000000 00000000 0... 1010|");    // 31 .A
    DECODE_ENTRY(0, 4_XB_SAR      ,  "|00000000 00000000 00000000 0... 1011|");    // 31 .B
    DECODE_ENTRY(0, 4_Y0_BTCLR    ,  "|00000000 00000000 00000000 1... 0000|");    // 31 .0
    DECODE_ENTRY(0, 4_Y1_BTCLR    ,  "|00000000 00000000 00000000 1... 0001|");    // 31 .1
    DECODE_ENTRY(0, 4_Y2_BT       ,  "|00000000 00000000 00000000 1... 0010|");    // 31 .2
    DECODE_ENTRY(0, 4_Y3_BT       ,  "|00000000 00000000 00000000 1... 0011|");    // 31 .3
    DECODE_ENTRY(0, 4_Y4_BF       ,  "|00000000 00000000 00000000 1... 0100|");    // 31 .4
    DECODE_ENTRY(0, 4_Y5_BF       ,  "|00000000 00000000 00000000 1... 0101|");    // 31 .5
    DECODE_ENTRY(0, 4_XC_SHLW     ,  "|00000000 00000000 00000000 .... 1100|");    // 31 .C
    DECODE_ENTRY(0, 4_XD_SHLW     ,  "|00000000 00000000 00000000 .... 1101|");    // 31 .D
    DECODE_ENTRY(0, 4_XE_SHRW     ,  "|00000000 00000000 00000000 .... 1110|");    // 31 .E
    DECODE_ENTRY(0, 4_XF_SARW     ,  "|00000000 00000000 00000000 .... 1111|");    // 31 .F

    return table;
}

Uns32 ary_num_operand_fetch[RL78_IT_LAST][2] = {
    [RL78_IT_1_00_NOP      ] = { 0 , 0 },        // NOP
    [RL78_IT_1_02_ADDW     ] = { 0 , 2 },        // ADDW    AX, !addr16
    [RL78_IT_1_04_ADDW     ] = { 0 , 2 },        // ADDW    AX, #word
    [RL78_IT_1_06_ADDW     ] = { 0 , 1 },        // ADDW    AX, saddrp
    [RL78_IT_1_0X_ADDW     ] = { 0 , 0 },        // ADDW    AX, ??
    [RL78_IT_1_08_XCH      ] = { 0 , 0 },        // XCH     A, X
    [RL78_IT_1_09_MOV      ] = { 0 , 2 },        // MOV     A, word[B]
    [RL78_IT_1_0A_ADD      ] = { 1 , 1 },        // ADD     saddr, #byte
    [RL78_IT_1_0B_ADD      ] = { 0 , 1 },        // ADD     A, saddr
    [RL78_IT_1_0C_ADD      ] = { 0 , 1 },        // ADD     A, #byte
    [RL78_IT_1_0D_ADD      ] = { 0 , 0 },        // ADD     A, [HL]
    [RL78_IT_1_0E_ADD      ] = { 0 , 1 },        // ADD     A, [HL+byte]
    [RL78_IT_1_0F_ADD      ] = { 0 , 2 },        // ADD     A, !addr16
    [RL78_IT_1_10_ADDW     ] = { 0 , 1 },        // ADDW    SP, #byte
    [RL78_IT_1_11_PREFIX   ] = { 0 , 0 },        // PREFIX
    [RL78_IT_1_1X_MOVW     ] = { 0 , 0 },        // MOVW    ??, AX
    [RL78_IT_1_1Y_MOVW     ] = { 0 , 0 },        // MOVW    AX, ??
    [RL78_IT_1_18_MOV      ] = { 2 , 0 },        // MOV     word[B], A
    [RL78_IT_1_19_MOV      ] = { 2 , 1 },        // MOV     word[B], #byte
    [RL78_IT_1_1A_ADDC     ] = { 1 , 1 },        // ADDC    saddr, #byte
    [RL78_IT_1_1B_ADDC     ] = { 0 , 1 },        // ADDC    A, saddr
    [RL78_IT_1_1C_ADDC     ] = { 0 , 1 },        // ADDC    A, #byte
    [RL78_IT_1_1D_ADDC     ] = { 0 , 0 },        // ADDC    A, [HL]
    [RL78_IT_1_1E_ADDC     ] = { 0 , 1 },        // ADDC    A, [HL+byte]
    [RL78_IT_1_1F_ADDC     ] = { 0 , 2 },        // ADDC    A, !addr16
    [RL78_IT_1_20_SUBW     ] = { 0 , 1 },        // SUBW    SP, #byte
    [RL78_IT_1_22_SUBW     ] = { 0 , 2 },        // SUBW    AX, !addr16
    [RL78_IT_1_24_SUBW     ] = { 0 , 2 },        // SUBW    AX, #word
    [RL78_IT_1_26_SUBW     ] = { 0 , 1 },        // SUBW    AX, saddrp
    [RL78_IT_1_2X_SUBW     ] = { 0 , 0 },        // SUBW    AX, ??
    [RL78_IT_1_28_MOV      ] = { 2 , 0 },        // MOV     word[C] ,A
    [RL78_IT_1_29_MOV      ] = { 0 , 2 },        // MOV     A, word[C]
    [RL78_IT_1_2A_SUB      ] = { 1 , 1 },        // SUB     saddr, #byte
    [RL78_IT_1_2B_SUB      ] = { 0 , 1 },        // SUB     A, saddr
    [RL78_IT_1_2C_SUB      ] = { 0 , 1 },        // SUB     A, #byte
    [RL78_IT_1_2D_SUB      ] = { 0 , 0 },        // SUB     A, [HL]
    [RL78_IT_1_2E_SUB      ] = { 0 , 1 },        // SUB     A, [HL+byte]
    [RL78_IT_1_2F_SUB      ] = { 0 , 2 },        // SUB     A, !addr16
    [RL78_IT_1_31_4thmap   ] = { 0 , 0 },        // 4thmap
    [RL78_IT_1_3X_XCHW     ] = { 0 , 0 },        // XCHW    AX, ??
    [RL78_IT_1_3Y_MOVW     ] = { 0 , 2 },        // MOVW    ??, #word
    [RL78_IT_1_38_MOV      ] = { 2 , 1 },        // MOV     word[C], #byte
    [RL78_IT_1_39_MOV      ] = { 2 , 1 },        // MOV     word[BC], #byte
    [RL78_IT_1_3A_SUBC     ] = { 1 , 1 },        // SUBC    saddr, #byte            //d <- a - b - C
    [RL78_IT_1_3B_SUBC     ] = { 0 , 1 },        // SUBC    A, saddr
    [RL78_IT_1_3C_SUBC     ] = { 0 , 1 },        // SUBC    A, #byte
    [RL78_IT_1_3D_SUBC     ] = { 0 , 0 },        // SUBC    A, [HL]
    [RL78_IT_1_3E_SUBC     ] = { 0 , 1 },        // SUBC    A, [HL+byte]
    [RL78_IT_1_3F_SUBC     ] = { 0 , 2 },        // SUBC    A, !addr16
    [RL78_IT_1_40_CMP      ] = { 2 , 1 },        // CMP     !addr16, #byte
    [RL78_IT_1_41_MOV      ] = { 0 , 1 },        // MOV     ES, #byte
    [RL78_IT_1_42_CMPW     ] = { 0 , 2 },        // CMPW    AX, !addr16
    [RL78_IT_1_44_CMPW     ] = { 0 , 2 },        // CMPW    AX, #word
    [RL78_IT_1_46_CMPW     ] = { 0 , 1 },        // CMPW    AX, saddrp
    [RL78_IT_1_4X_CMPW     ] = { 0 , 0 },        // CMPW    AX, ??
    [RL78_IT_1_48_MOV      ] = { 2 , 0 },        // MOV     word[BC], A
    [RL78_IT_1_49_MOV      ] = { 0 , 2 },        // MOV     A, word[BC]
    [RL78_IT_1_4A_CMP      ] = { 1 , 1 },        // CMP     saddr, #byte
    [RL78_IT_1_4B_CMP      ] = { 0 , 1 },        // CMP     A, saddr
    [RL78_IT_1_4C_CMP      ] = { 0 , 1 },        // CMP     A, #byte
    [RL78_IT_1_4D_CMP      ] = { 0 , 0 },        // CMP     A, [HL]
    [RL78_IT_1_4E_CMP      ] = { 0 , 1 },        // CMP     A, [HL+byte]
    [RL78_IT_1_4F_CMP      ] = { 0 , 2 },        // CMP     A, !addr16
    [RL78_IT_1_5X_MOV      ] = { 0 , 1 },        // MOV     ?, #byte
    [RL78_IT_1_58_MOVW     ] = { 2 , 0 },        // MOVW    word[B], AX
    [RL78_IT_1_59_MOVW     ] = { 0 , 2 },        // MOVW    AX, word[B]
    [RL78_IT_1_5A_AND      ] = { 1 , 1 },        // AND     saddr, #byte
    [RL78_IT_1_5B_AND      ] = { 0 , 1 },        // AND     A, saddr
    [RL78_IT_1_5C_AND      ] = { 0 , 1 },        // AND     A, #byte
    [RL78_IT_1_5D_AND      ] = { 0 , 0 },        // AND     A, [HL]
    [RL78_IT_1_5E_AND      ] = { 0 , 1 },        // AND     A, [HL+byte]
    [RL78_IT_1_5F_AND      ] = { 0 , 2 },        // AND     A, !addr16
    [RL78_IT_1_61_2ndmap   ] = { 0 , 0 },        // 2ndmap
    [RL78_IT_1_6X_MOV      ] = { 0 , 0 },        // MOV     A, ?
    [RL78_IT_1_68_MOVW     ] = { 2 , 0 },        // MOVW    word[C], AX
    [RL78_IT_1_69_MOVW     ] = { 0 , 2 },        // MOVW    AX, word[C]
    [RL78_IT_1_6A_OR       ] = { 1 , 1 },        // OR      saddr, #byte
    [RL78_IT_1_6B_OR       ] = { 0 , 1 },        // OR      A, saddr
    [RL78_IT_1_6C_OR       ] = { 0 , 1 },        // OR      A, #byte
    [RL78_IT_1_6D_OR       ] = { 0 , 0 },        // OR      A, [HL]
    [RL78_IT_1_6E_OR       ] = { 0 , 1 },        // OR      A, [HL+byte]
    [RL78_IT_1_6F_OR       ] = { 0 , 2 },        // OR      A, !addr16
    [RL78_IT_1_71_3rdmap   ] = { 0 , 0 },        // 3rdmap
    [RL78_IT_1_7X_MOV      ] = { 0 , 0 },        // MOV     ?, A
    [RL78_IT_1_78_MOVW     ] = { 2 , 0 },        // MOVW    word[BC], AX
    [RL78_IT_1_79_MOVW     ] = { 0 , 2 },        // MOVW    AX, word[BC]
    [RL78_IT_1_7A_XOR      ] = { 1 , 1 },        // XOR     saddr, #byte
    [RL78_IT_1_7B_XOR      ] = { 0 , 1 },        // XOR     A, saddr
    [RL78_IT_1_7C_XOR      ] = { 0 , 1 },        // XOR     A, #byte
    [RL78_IT_1_7D_XOR      ] = { 0 , 0 },        // XOR     A, [HL]
    [RL78_IT_1_7E_XOR      ] = { 0 , 1 },        // XOR     A, [HL+byte]
    [RL78_IT_1_7F_XOR      ] = { 0 , 2 },        // XOR     A, !addr16
    [RL78_IT_1_8X_INC      ] = { 0 , 0 },        // INC     ?
    [RL78_IT_1_88_MOV      ] = { 0 , 1 },        // MOV     A, [SP+byte]
    [RL78_IT_1_89_MOV      ] = { 0 , 0 },        // MOV     A, [DE]
    [RL78_IT_1_8A_MOV      ] = { 0 , 1 },        // MOV     A, [DE+byte]
    [RL78_IT_1_8B_MOV      ] = { 0 , 0 },        // MOV     A, [HL]
    [RL78_IT_1_8C_MOV      ] = { 0 , 1 },        // MOV     A, [HL+byte]
    [RL78_IT_1_8D_MOV      ] = { 0 , 1 },        // MOV     A, saddr
    [RL78_IT_1_8E_MOV      ] = { 0 , 1 },        // MOV     A, sfr
    [RL78_IT_1_8F_MOV      ] = { 0 , 2 },        // MOV     A, !addr16
    [RL78_IT_1_9X_DEC      ] = { 0 , 0 },        // DEC     ?
    [RL78_IT_1_98_MOV      ] = { 1 , 0 },        // MOV     [SP+byte], A
    [RL78_IT_1_99_MOV      ] = { 0 , 0 },        // MOV     [DE], A
    [RL78_IT_1_9A_MOV      ] = { 1 , 0 },        // MOV     [DE+byte], A
    [RL78_IT_1_9B_MOV      ] = { 0 , 0 },        // MOV     [HL], A
    [RL78_IT_1_9C_MOV      ] = { 1 , 0 },        // MOV     [HL+byte], A
    [RL78_IT_1_9D_MOV      ] = { 1 , 0 },        // MOV     saddr, A
    [RL78_IT_1_9E_MOV      ] = { 1 , 0 },        // MOV     sfr, A
    [RL78_IT_1_9F_MOV      ] = { 2 , 0 },        // MOV     !addr16, A
    [RL78_IT_1_A0_INC      ] = { 2 , 0 },        // INC     !addr16
    [RL78_IT_1_A2_INCW     ] = { 2 , 0 },        // INCW    !addr16
    [RL78_IT_1_A4_INC      ] = { 1 , 0 },        // INC     saddr
    [RL78_IT_1_A6_INCW     ] = { 1 , 0 },        // INCW    saddrp
    [RL78_IT_1_AX_INCW     ] = { 0 , 0 },        // INCW    ??
    [RL78_IT_1_A8_MOVW     ] = { 0 , 1 },        // MOVW    AX, [SP+byte]
    [RL78_IT_1_A9_MOVW     ] = { 0 , 0 },        // MOVW    AX, [DE]
    [RL78_IT_1_AA_MOVW     ] = { 0 , 1 },        // MOVW    AX, [DE+byte]
    [RL78_IT_1_AB_MOVW     ] = { 0 , 0 },        // MOVW    AX, [HL]
    [RL78_IT_1_AC_MOVW     ] = { 0 , 1 },        // MOVW    AX, [HL+byte]
    [RL78_IT_1_AD_MOVW     ] = { 0 , 1 },        // MOVW    AX, saddrp
    [RL78_IT_1_AE_MOVW     ] = { 0 , 1 },        // MOVW    AX, sfrp
    [RL78_IT_1_AF_MOVW     ] = { 0 , 2 },        // MOVW    AX, !addr16
    [RL78_IT_1_B0_DEC      ] = { 2 , 0 },        // DEC     !addr16
    [RL78_IT_1_B2_DECW     ] = { 2 , 0 },        // DECW    !addr16
    [RL78_IT_1_B4_DEC      ] = { 1 , 0 },        // DEC     saddr
    [RL78_IT_1_B6_DECW     ] = { 1 , 0 },        // DECW    saddrp
    [RL78_IT_1_BX_DECW     ] = { 0 , 0 },        // DECW    ??
    [RL78_IT_1_B8_MOVW     ] = { 1 , 0 },        // MOVW    [SP+byte], AX
    [RL78_IT_1_B9_MOVW     ] = { 0 , 0 },        // MOVW    [DE], AX
    [RL78_IT_1_BA_MOVW     ] = { 1 , 0 },        // MOVW    [DE+byte], AX
    [RL78_IT_1_BB_MOVW     ] = { 0 , 0 },        // MOVW    [HL], AX
    [RL78_IT_1_BC_MOVW     ] = { 1 , 0 },        // MOVW    [HL+byte], AX
    [RL78_IT_1_BD_MOVW     ] = { 1 , 0 },        // MOVW    saddrp, AX
    [RL78_IT_1_BE_MOVW     ] = { 1 , 0 },        // MOVW    sfrp, AX
    [RL78_IT_1_BF_MOVW     ] = { 2 , 0 },        // MOVW    !addr16, AX
    [RL78_IT_1_CX_POP      ] = { 0 , 0 },        // POP     ??
    [RL78_IT_1_CY_PUSH     ] = { 0 , 0 },        // PUSH    ??
    [RL78_IT_1_C8_MOV      ] = { 1 , 1 },        // MOV     [SP+byte], #byte
    [RL78_IT_1_C9_MOVW     ] = { 1 , 2 },        // MOVW    saddrp, #word
    [RL78_IT_1_CA_MOV      ] = { 1 , 1 },        // MOV     [DE+byte], #byte
    [RL78_IT_1_CB_MOVW     ] = { 1 , 2 },        // MOVW    sfrp, #word
    [RL78_IT_1_CC_MOV      ] = { 1 , 1 },        // MOV     [HL+byte], #byte
    [RL78_IT_1_CD_MOV      ] = { 1 , 1 },        // MOV     saddr, #byte
    [RL78_IT_1_CE_MOV_SFR  ] = { 1 , 1 },        // MOV     sfr, #byte
    //       1_CE_MOV_PSW                        // MOV     PSW, #byte
    //       1_CE_MOV_CS                        // MOV     CS, #byte
    [RL78_IT_1_CF_MOV      ] = { 2 , 1 },        // MOV     !addr16, #byte
    [RL78_IT_1_DX_CMP0     ] = { 0 , 0 },        // CMP0    ?
    [RL78_IT_1_D4_CMP0     ] = { 1 , 0 },        // CMP0    saddr
    [RL78_IT_1_D5_CMP0     ] = { 2 , 0 },        // CMP0    !addr16
    [RL78_IT_1_D6_MULU     ] = { 0 , 0 },        // MULU    X
    [RL78_IT_1_D7_RET      ] = { 0 , 0 },        // RET
    [RL78_IT_1_D8_MOV      ] = { 0 , 1 },        // MOV     X, saddr
    [RL78_IT_1_D9_MOV      ] = { 0 , 2 },        // MOV     X, !addr16
    [RL78_IT_1_DC_BC       ] = { 1 , 0 },        // BC      $addr20
    [RL78_IT_1_DD_BZ       ] = { 1 , 0 },        // BZ      $addr20
    [RL78_IT_1_DE_BNC      ] = { 1 , 0 },        // BNC     $addr20
    [RL78_IT_1_DF_BNZ      ] = { 1 , 0 },        // BNZ     $addr20
    [RL78_IT_1_EX_ONEB     ] = { 0 , 0 },        // ONEB    ?
    [RL78_IT_1_E4_ONEB     ] = { 1 , 0 },        // ONEB    saddr
    [RL78_IT_1_E5_ONEB     ] = { 2 , 0 },        // ONEB    !addr16
    [RL78_IT_1_E6_ONEW     ] = { 0 , 0 },        // ONEW    AX
    [RL78_IT_1_E7_ONEW     ] = { 0 , 0 },        // ONEW    BC
    [RL78_IT_1_E8_MOV      ] = { 0 , 1 },        // MOV     B, saddr
    [RL78_IT_1_E9_MOV      ] = { 0 , 2 },        // MOV     B, !addr16
    [RL78_IT_1_EC_BR       ] = { 3 , 0 },        // BR      !!addr20
    [RL78_IT_1_ED_BR       ] = { 2 , 0 },        // BR      !addr16
    [RL78_IT_1_EE_BR       ] = { 2 , 0 },        // BR      $!addr20
    [RL78_IT_1_EF_BR       ] = { 1 , 0 },        // BR      $addr20
    [RL78_IT_1_FX_CLRB     ] = { 0 , 0 },        // CLRB    ?
    [RL78_IT_1_F4_CLRB     ] = { 1 , 0 },        // CLRB    saddr
    [RL78_IT_1_F5_CLRB     ] = { 2 , 0 },        // CLRB    !addr16
    [RL78_IT_1_F6_CLRW     ] = { 0 , 0 },        // CLRW    AX
    [RL78_IT_1_F7_CLRW     ] = { 0 , 0 },        // CLRW    BC
    [RL78_IT_1_F8_MOV      ] = { 0 , 1 },        // MOV     C, saddr
    [RL78_IT_1_F9_MOV      ] = { 0 , 2 },        // MOV     C, !addr16
    [RL78_IT_1_FC_CALL     ] = { 3 , 0 },        // CALL    !!addr20
    [RL78_IT_1_FD_CALL     ] = { 2 , 0 },        // CALL    !addr16
    [RL78_IT_1_FE_CALL     ] = { 2 , 0 },        // CALL    $!addr20
    [RL78_IT_1_XA_MOVW     ] = { 0 , 1 },        // MOVW    ??, saddrp
    [RL78_IT_1_XB_MOVW     ] = { 0 , 2 },        // MOVW    ??, !addr16

    [RL78_IT_2_0X_ADD      ] = { 0 , 0 },        // ADD     ?, A
    [RL78_IT_2_09_ADDW     ] = { 0 , 1 },        // ADDW    AX, [HL+byte]
    [RL78_IT_2_0Y_ADD      ] = { 0 , 0 },        // ADD     A, ?
    [RL78_IT_2_1X_ADDC     ] = { 0 , 0 },        // ADDC    ?, A
    [RL78_IT_2_1Y_ADDC     ] = { 0 , 0 },        // ADDC    A, ?
    [RL78_IT_2_2X_SUB      ] = { 0 , 0 },        // SUB     ?, A
    [RL78_IT_2_29_SUBW     ] = { 0 , 1 },        // SUBW    AX, [HL+byte]
    [RL78_IT_2_2Y_SUB      ] = { 0 , 0 },        // SUB     A, ?
    [RL78_IT_2_3X_SUBC     ] = { 0 , 0 },        // SUBC    ?, A
    [RL78_IT_2_3Y_SUBC     ] = { 0 , 0 },        // SUBC    A, ?
    [RL78_IT_2_4X_CMP      ] = { 0 , 0 },        // CMP     ?, A
    [RL78_IT_2_49_CMPW     ] = { 0 , 1 },        // CMPW    AX, [HL+byte]
    [RL78_IT_2_4Y_CMP      ] = { 0 , 0 },        // CMP     A, ?
    [RL78_IT_2_5X_AND      ] = { 0 , 0 },        // AND     ?, A
    [RL78_IT_2_59_INC      ] = { 1 , 0 },        // INC     [HL+byte]
    [RL78_IT_2_5Y_AND      ] = { 0 , 0 },        // AND     A, ?
    [RL78_IT_2_6X_OR       ] = { 0 , 0 },        // OR      ?, A
    [RL78_IT_2_69_DEC      ] = { 1 , 0 },        // DEC     [HL+byte]
    [RL78_IT_2_6Y_OR       ] = { 0 , 0 },        // OR      A, ?
    [RL78_IT_2_7X_XOR      ] = { 0 , 0 },        // XOR     ?, A
    [RL78_IT_2_79_INCW     ] = { 1 , 0 },        // INCW    [HL+byte]
    [RL78_IT_2_7Y_XOR      ] = { 0 , 0 },        // XOR     A, ?
    [RL78_IT_2_80_ADD      ] = { 0 , 0 },        // ADD     A, [HL+B]
    [RL78_IT_2_82_ADD      ] = { 0 , 0 },        // ADD     A, [HL+C]
    [RL78_IT_2_89_DECW     ] = { 1 , 0 },        // DECW    [HL+byte]
    [RL78_IT_2_8X_XCH      ] = { 0 , 0 },        // XCH     A, ?
    [RL78_IT_2_90_ADDC     ] = { 0 , 0 },        // ADDC    A, [HL+B]
    [RL78_IT_2_92_ADDC     ] = { 0 , 0 },        // ADDC    A, [HL+C]
    [RL78_IT_2_A0_SUB      ] = { 0 , 0 },        // SUB     A, [HL+B]
    [RL78_IT_2_A2_SUB      ] = { 0 , 0 },        // SUB     A, [HL+C]
    [RL78_IT_2_A8_XCH      ] = { 0 , 1 },        // XCH     A, saddr
    [RL78_IT_2_A9_XCH      ] = { 0 , 0 },        // XCH     A, [HL+C]
    [RL78_IT_2_AA_XCH      ] = { 0 , 2 },        // XCH     A, !addr16
    [RL78_IT_2_AB_XCH      ] = { 0 , 1 },        // XCH     A, sfr
    [RL78_IT_2_AC_XCH      ] = { 0 , 0 },        // XCH     A, [HL]
    [RL78_IT_2_AD_XCH      ] = { 0 , 1 },        // XCH     A, [HL+byte]
    [RL78_IT_2_AE_XCH      ] = { 0 , 0 },        // XCH     A, [DE]
    [RL78_IT_2_AF_XCH      ] = { 0 , 1 },        // XCH     A, [DE+byte]
    [RL78_IT_2_B0_SUBC     ] = { 0 , 0 },        // SUBC    A, [HL+B]
    [RL78_IT_2_B2_SUBC     ] = { 0 , 0 },        // SUBC    A, [HL+C]
    [RL78_IT_2_B8_MOV      ] = { 0 , 1 },        // MOV     ES, saddr
    [RL78_IT_2_B9_XCH      ] = { 0 , 0 },        // XCH     A, [HL+B]
    [RL78_IT_2_C0_CMP      ] = { 0 , 0 },        // CMP     A, [HL+B]
    [RL78_IT_2_C2_CMP      ] = { 0 , 0 },        // CMP     A, [HL+C]
    [RL78_IT_2_C3_BH       ] = { 1 , 0 },        // BH      $addr20
    [RL78_IT_2_C8_SKC      ] = { 0 , 0 },        // SKC
    [RL78_IT_2_C9_MOV      ] = { 0 , 0 },        // MOV     A, [HL+B]
    [RL78_IT_2_CB_BR       ] = { 0 , 0 },        // BR      AX
    [RL78_IT_2_CC_BRK      ] = { 0 , 0 },        // BRK
    [RL78_IT_2_CD_POP      ] = { 0 , 0 },        // POP     PSW
    [RL78_IT_2_CE_MOVS     ] = { 1 , 0 },        // MOVS    [HL+byte], X
    [RL78_IT_2_D0_AND      ] = { 0 , 0 },        // AND     A, [HL+B]
    [RL78_IT_2_D2_AND      ] = { 0 , 0 },        // AND     A, [HL+C]
    [RL78_IT_2_D3_BNH      ] = { 1 , 0 },        // BNH     $addr20
    [RL78_IT_2_D8_SKNC     ] = { 0 , 0 },        // SKNC
    [RL78_IT_2_D9_MOV      ] = { 0 , 0 },        // MOV     [HL+B], A
    [RL78_IT_2_DB_ROR      ] = { 0 , 0 },        // ROR     A, 1
    [RL78_IT_2_DC_ROLC     ] = { 0 , 0 },        // ROLC    A, 1
    [RL78_IT_2_DD_PUSH     ] = { 0 , 0 },        // PUSH    PSW
    [RL78_IT_2_DE_CMPS     ] = { 0 , 1 },        // CMPS    X, [HL+byte]
    [RL78_IT_2_E0_OR       ] = { 0 , 0 },        // OR      A, [HL+B]
    [RL78_IT_2_E2_OR       ] = { 0 , 0 },        // OR      A, [HL+C]
    [RL78_IT_2_E3_SKH      ] = { 0 , 0 },        // SKH
    [RL78_IT_2_E8_SKZ      ] = { 0 , 0 },        // SKZ
    [RL78_IT_2_E9_MOV      ] = { 0 , 0 },        // MOV     A, [HL+C]
    [RL78_IT_2_EB_ROL      ] = { 0 , 0 },        // ROL     A, 1
    [RL78_IT_2_EC_RETB     ] = { 0 , 0 },        // RETB
    [RL78_IT_2_ED_HALT     ] = { 0 , 0 },        // HALT
    [RL78_IT_2_F0_XOR      ] = { 0 , 0 },        // XOR     A, [HL+B]
    [RL78_IT_2_F2_XOR      ] = { 0 , 0 },        // XOR     A, [HL+C]
    [RL78_IT_2_F3_SKNH     ] = { 0 , 0 },        // SKNH
    [RL78_IT_2_F8_SKNZ     ] = { 0 , 0 },        // SKNZ
    [RL78_IT_2_F9_MOV      ] = { 0 , 0 },        // MOV     [HL+C], A
    [RL78_IT_2_FB_RORC     ] = { 0 , 0 },        // RORC    A, 1
    [RL78_IT_2_FC_RETI     ] = { 0 , 0 },        // RETI
    [RL78_IT_2_FD_STOP     ] = { 0 , 0 },        // STOP
    [RL78_IT_2_XE_ROLWC    ] = { 0 , 0 },        // ROLWC   ??, 1
    [RL78_IT_2_XF_SEL      ] = { 0 , 0 },        // SEL     RBn
    [RL78_IT_2_XA_CALL     ] = { 0 , 0 },        // CALL    ??
    [RL78_IT_2_XX_CALLT    ] = { 0 , 0 },        // CALLT   [00nnh]

