emanuellucas2/OVPsimProject/ImperasLib/source/renesas.ovpworld.org/processor/rl78/1.0/model/rl78Decode.c
    [RL78_IT_3_X0_SET1     ] = { 2 , 0 },        // SET1    !addr16.n
    [RL78_IT_3_X1_MOV1     ] = { 1 , 0 },        // MOV1    saddr.n, CY
    [RL78_IT_3_X2_SET1     ] = { 1 , 0 },        // SET1    saddr.n
    [RL78_IT_3_X3_CLR1     ] = { 1 , 0 },        // CLR1    saddr.n
    [RL78_IT_3_X4_MOV1     ] = { 0 , 1 },        // MOV1    CY, saddr.n
    [RL78_IT_3_X5_AND1     ] = { 0 , 1 },        // AND1    CY, saddr.n
    [RL78_IT_3_X6_OR1      ] = { 0 , 1 },        // OR1     CY, saddr.n
    [RL78_IT_3_X7_XOR1     ] = { 0 , 1 },        // XOR1    CY, saddr.n
    [RL78_IT_3_X8_CLR1     ] = { 2 , 0 },        // CLR1    !addr16.n
    [RL78_IT_3_X9_MOV1     ] = { 1 , 0 },        // MOV1    sfr.n, CY
    [RL78_IT_3_XA_SET1     ] = { 1 , 0 },        // SET1    sfr.n
    [RL78_IT_3_XB_CLR1     ] = { 1 , 0 },        // CLR1    sfr.n
    [RL78_IT_3_XC_MOV1     ] = { 0 , 1 },        // MOV1    CY, sfr.n
    [RL78_IT_3_XD_AND1     ] = { 0 , 1 },        // AND1    CY, sfr.n
    [RL78_IT_3_XE_OR1      ] = { 0 , 1 },        // OR1     CY, sfr.n
    [RL78_IT_3_XF_XOR1     ] = { 0 , 1 },        // XOR1    CY, sfr.n
    [RL78_IT_3_80_SET1     ] = { 0 , 0 },        // SET1    CY
    [RL78_IT_3_88_CLR1     ] = { 0 , 0 },        // CLR1    CY
    [RL78_IT_3_C0_NOT1     ] = { 0 , 0 },        // NOT1    CY
    [RL78_IT_3_Y1_MOV1     ] = { 0 , 0 },        // MOV1    [HL].n, CY
    [RL78_IT_3_Y2_SET1     ] = { 0 , 0 },        // SET1    [HL].n
    [RL78_IT_3_Y3_CLR1     ] = { 0 , 0 },        // CLR1    [HL].n
    [RL78_IT_3_Y4_MOV1     ] = { 0 , 0 },        // MOV1    CY, [HL].n
    [RL78_IT_3_Y5_AND1     ] = { 0 , 0 },        // AND1    CY, [HL].n
    [RL78_IT_3_Y6_OR1      ] = { 0 , 0 },        // OR1     CY, [HL].n
    [RL78_IT_3_Y7_XOR1     ] = { 0 , 0 },        // XOR1    CY, [HL].n
    [RL78_IT_3_Y9_MOV1     ] = { 0 , 0 },        // MOV1    A.n, CY
    [RL78_IT_3_YA_SET1     ] = { 0 , 0 },        // SET1    A.n
    [RL78_IT_3_YB_CLR1     ] = { 0 , 0 },        // CLR1    A.n
    [RL78_IT_3_YC_MOV1     ] = { 0 , 0 },        // MOV1    CY, A.n
    [RL78_IT_3_YD_AND1     ] = { 0 , 0 },        // AND1    CY, A.n
    [RL78_IT_3_YE_OR1      ] = { 0 , 0 },        // OR1     CY, A.n
    [RL78_IT_3_YF_XOR1     ] = { 0 , 0 },        // XOR1    CY, A.n

    [RL78_IT_4_X0_BTCLR    ] = { 1 , 1 },        // BTCLR   saddr.n, $addr20
    [RL78_IT_4_X1_BTCLR    ] = { 0 , 1 },        // BTCLR   A.n, $addr20
    [RL78_IT_4_X2_BT       ] = { 1 , 1 },        // BT      saddr.n, $addr20
    [RL78_IT_4_X3_BT       ] = { 0 , 1 },        // BT      A.n, $addr20
    [RL78_IT_4_X4_BF       ] = { 1 , 1 },        // BF      saddr.n, $addr20
    [RL78_IT_4_X5_BF       ] = { 0 , 1 },        // BF      A.n, $addr20
    [RL78_IT_4_X7_SHL      ] = { 0 , 0 },        // SHL     C, n
    [RL78_IT_4_X8_SHL      ] = { 0 , 0 },        // SHL     B, n
    [RL78_IT_4_X9_SHL      ] = { 0 , 0 },        // SHL     A, n
    [RL78_IT_4_XA_SHR      ] = { 0 , 0 },        // SHR     A, n
    [RL78_IT_4_XB_SAR      ] = { 0 , 0 },        // SAR     A, n
    [RL78_IT_4_Y0_BTCLR    ] = { 1 , 1 },        // BTCLR   sfr.n, $addr20
    [RL78_IT_4_Y1_BTCLR    ] = { 0 , 1 },        // BTCLR   [HL].n, $addr20
    [RL78_IT_4_Y2_BT       ] = { 1 , 1 },        // BT      sfr.n, $addr20
    [RL78_IT_4_Y3_BT       ] = { 0 , 1 },        // BT      [HL].n, $addr20
    [RL78_IT_4_Y4_BF       ] = { 1 , 1 },        // BF      sfr.n, $addr20
    [RL78_IT_4_Y5_BF       ] = { 0 , 1 },        // BF      [HL].n, $addr20
    [RL78_IT_4_XC_SHLW     ] = { 0 , 0 },        // SHLW    BC, nn
    [RL78_IT_4_XD_SHLW     ] = { 0 , 0 },        // SHLW    AX, nn
    [RL78_IT_4_XE_SHRW     ] = { 0 , 0 },        // SHRW    AX, nn
    [RL78_IT_4_XF_SARW     ] = { 0 , 0 }         // SARW    AX, nn
};


//
// Decode an instruction and return the instruction type (or RL78_IT_LAST if
// the decode failed)
//
static rl78InstructionType decodeInt(rl78P rl78, Uns32 thisPC, Uns8 *instr) {

    static vmidDecodeTableP decodeTable_1stmap;
    static vmidDecodeTableP decodeTable_2ndmap;
    static vmidDecodeTableP decodeTable_3rdmap;
    static vmidDecodeTableP decodeTable_4thmap;

    if (!decodeTable_1stmap) {
        decodeTable_1stmap = createDecodeTable_1stmap();
        decodeTable_2ndmap = createDecodeTable_2ndmap();
        decodeTable_3rdmap = createDecodeTable_3rdmap();
        decodeTable_4thmap = createDecodeTable_4thmap();
    }

    vmiProcessorP       processor = (vmiProcessorP)rl78;
    Uns32               iii;
    Uns32               fetchByte;
    rl78InstructionType type;

    // clear decode-related fields
    memset(instr, 0, 8);
    rl78->len_instByte = 0;            // instruction length (byte)
    rl78->len_instMnem = 0;            // mnemonic length
    rl78->len_instPrefix = 0;        // prefix length

    // 1st byte
    fetchByte = vmicxtFetch1Byte(processor, thisPC + rl78->len_instByte);
    type      = vmidDecode(decodeTable_1stmap, fetchByte);
    instr[rl78->len_instByte] = fetchByte;
    rl78->len_instByte += 1;
    rl78->len_instMnem = 1;

    // handle ES prefix specification
    if (type == RL78_IT_1_11_PREFIX) {
        rl78->len_instPrefix = 1;
        fetchByte = vmicxtFetch1Byte(processor, thisPC + rl78->len_instByte);
        type      = vmidDecode(decodeTable_1stmap, fetchByte);
        instr[rl78->len_instByte] = fetchByte;
        rl78->len_instByte += 1;
    }

    // special case decode failure
    if (type == RL78_IT_1_2X_SUBW) {            // SUBW    AX, ??
        if (instr[rl78->len_instPrefix + 0] == 0x21) {
            return RL78_IT_LAST;
        }
    }

    // 2nd byte
    if        (type == RL78_IT_1_61_2ndmap) {
        fetchByte = vmicxtFetch1Byte(processor, thisPC + rl78->len_instByte);
        type      = vmidDecode(decodeTable_2ndmap, fetchByte);
        instr[rl78->len_instByte] = fetchByte;
        rl78->len_instByte += 1;
        rl78->len_instMnem = 2;

    } else if (type == RL78_IT_1_71_3rdmap) {
        fetchByte = vmicxtFetch1Byte(processor, thisPC + rl78->len_instByte);
        type      = vmidDecode(decodeTable_3rdmap, fetchByte);
        instr[rl78->len_instByte] = fetchByte;
        rl78->len_instByte += 1;
        rl78->len_instMnem = 2;

    } else if (type == RL78_IT_1_31_4thmap) {
        fetchByte = vmicxtFetch1Byte(processor, thisPC + rl78->len_instByte);
        type      = vmidDecode(decodeTable_4thmap, fetchByte);
        instr[rl78->len_instByte] = fetchByte;
        rl78->len_instByte += 1;
        rl78->len_instMnem = 2;
    }

