emanuellucas2/OVPsimProject/ImperasLib/source/renesas.ovpworld.org/processor/rl78/1.0/model/rl78Decode.c
    // operands
    if (type != RL78_IT_LAST) {

        Uns32 int_oper = ary_num_operand_fetch[type][0] + ary_num_operand_fetch[type][1];

        for (iii = 0; iii < int_oper; iii++) {
            fetchByte = vmicxtFetch1Byte(processor, thisPC + rl78->len_instByte);
            instr[rl78->len_instByte] = fetchByte;
            rl78->len_instByte += 1;
        }

        if (type == RL78_IT_1_CE_MOV_SFR) {            // len_instByte == 3                // MOV     sfr, #byte

            switch (instr[rl78->len_instPrefix + 1]) {
                case 0xFA: type = RL78_IT_1_CE_MOV_PSW; rl78->len_instMnem = 2; break;    // MOV     PSW, #byte
                case 0xFC: type = RL78_IT_1_CE_MOV_CS ; rl78->len_instMnem = 2; break;    // MOV     CS, #byte
                case 0xFB: {
                    switch (instr[rl78->len_instPrefix + 2]) {
                        case 0x01: type = RL78_IT_1_CE_MULHU; rl78->len_instMnem = 3; break;    // MULHU
                        case 0x02: type = RL78_IT_1_CE_MULH ; rl78->len_instMnem = 3; break;    // MULH
                        case 0x03: type = RL78_IT_1_CE_DIVHU; rl78->len_instMnem = 3; break;    // DIVHU
                        case 0x0B: type = RL78_IT_1_CE_DIVWU; rl78->len_instMnem = 3; break;    // DIVWU
                        case 0x05: type = RL78_IT_1_CE_MACHU; rl78->len_instMnem = 3; break;    // MACHU
                        case 0x06: type = RL78_IT_1_CE_MACH ; rl78->len_instMnem = 3; break;    // MACH
                        default: break;
                    }
                }
                default: break;
            }
        }

        if (instr[0] == 0x71) {        // RL78_IT_1_71_3rdmap
            if ((instr[1] == 0x7A) && (instr[2] == 0xFA)) {
                type = RL78_IT_3_7A_EI;
                rl78->len_instMnem = 3;
            } else if ((instr[1] == 0x7B) && (instr[2] == 0xFA)) {
                type = RL78_IT_3_7B_DI;
                rl78->len_instMnem = 3;
            }
        }
    }

    return type;
}

//
// If this is a skil prefix instruction, return the equivalent condition
//
static en_Cond getSkipPrefixCondition(rl78InstructionType type) {
    switch(type) {
        case RL78_IT_2_C8_SKC:  return en_Cond_C;
        case RL78_IT_2_D8_SKNC: return en_Cond_NC;
        case RL78_IT_2_E3_SKH:  return en_Cond_H;
        case RL78_IT_2_E8_SKZ:  return en_Cond_Z;
        case RL78_IT_2_F3_SKNH: return en_Cond_NH;
        case RL78_IT_2_F8_SKNZ: return en_Cond_NZ;
        default:                return en_Cond_T;
    }
}

//
// Decode the RL78 instruction at the passed address. If the decode succeeds,
// dispatch it to the corresponding function in the dispatch table and return
// True; otherwise, dispatch using the defaultCB and return False.
//
Bool rl78Decode(
    rl78P               rl78,
    Uns32               thisPC,
    rl78DispatchTableCP table,
    rl78DispatchFn      defaultCB,
    void               *userData) {

    Uns8                instr[8];
    rl78InstructionType type;
    en_Cond             cond = en_Cond_T;

    // initialize full instruction size including skip prefix and assume that
    // this instruction will not have a SKIP prefix
    rl78->len_instByteAndSkip = 0;
    rl78->skipCondition       = cond;

    do {

        // perform decode
        type = decodeInt(rl78, thisPC, instr);

        // accumulated full instruction size
        rl78->len_instByteAndSkip += rl78->len_instByte;

        // get any condition if this is a skip instruction
        cond = getSkipPrefixCondition(type);

        // decode next instruction as well if this is a skip instruction
        // (skip and following instruction must be treated atomically for
        // interrupt purposes, so it is effectively another kind of prefix)
        if (cond != en_Cond_T) {
            rl78->skipCondition = cond;
            thisPC += rl78->len_instByte;
        }

    } while (cond != en_Cond_T);

    if (type != RL78_IT_LAST) {

        // decode succeeded
        if (table) {
            ((*table)[type])(rl78, thisPC, instr, userData);
        }

        return True;

    } else {

        // decode failed
        if (defaultCB) {
            defaultCB(rl78, thisPC, instr, userData);
        }

        return False;
    }
}

